Repository: digicademy/xmltool
Catalog: Resources/Private/Language/*.locallang_mod_web_xmlimport.xlf
Languages: de

# mlang_labels_tabdescr
source: Imports XML data into the TYPO3 database
de: Importiert Datensätze aus XML in die TYPO3 Datenbank

# extract_function
source: Extraction & Preview
de: Extraktion & Voransicht

# batchimport_function
source: Batch import
de: Massenimport

# limit
source: Number of records
de: Anzahl Datensätze

# noLimit
source: All
de: Alle

# submitLegend
source: Submit XML file
de: XML-Datei auswählen

# selectFile
source: Choose one of the following files for import:
de: Eine der folgenden XML-Dateien verwenden

# urlFile
source: Enter URL from which to retrieve an XML file:
de: XML-Datei von folgender Webadresse laden

# directoryName
source: Folder:
de: Ordner:

# submitButton
source: Submit
de: Abschicken

# reloadButton
source: Reload
de: Neu laden

# importSingle
source: Correct and import extracted XML records one by one
de: XML-Extraktion und Voransicht

# importBatch
source: Batch import extracted XML records
de: Massenimport extrahierter XML-Datensätze

# extractedRecords
source: Found records:
de: Gefundene Datensätze:

# editData
source: Edit
de: Bearbeiten

# remainingRecords
source: Remaining XML records:
de: Verbleibende XML-Datensätze:

source: Current position:
de: Aktueller XML-Datensatz:

# importComplete
source: All records have been imported successfully.
de: Alle XML-Datensätze wurden erfolgreich importiert.

# standardFile
source: If you don't specify a file, the following standard file will be used:
de: Folgende XML-Datei bzw. Webadresse ist hinterlegt:

source: Fieldname
de: Feld

source: Value
de: Wert

source: Correction
de: Korrektur

# prev
source: &lt; Previous record
de: &lt; Vorheriger XML-Datensatz

# next
source: Next record &gt;
de: Nächster XML-Datensatz &gt;

# begin
source: &laquo; Begin
de: &laquo; Stapelanfang

# end
source: End &raquo;
de: Stapelende &raquo;

# uploadFile
source: File upload
de: Datei hochladen

source: Record
de: Datensatz

# pleasePerformExtractionFirst
source: You will first need to extract records from your XML.
de: Bitte nehmen Sie zuerst eine XML-Extraktion vor.

source: Go on
de: Die extrahierten Datensätze betrachten

# wouldYouLike
source: Would you like to:
de: Möchten Sie:

# doBatchImport
source: Start!
de: Massenimport direkt starten

source: Schedule for import
de: Massenimport via Planer aktivieren

# importJobScheduled
source: Import job scheduled for next run
de: Importjob angelegt für den nächsten Lauf des Planers

# scheduledJobActive
source: Page already contains a scheduled import job
de: Seite enthält bereits einen geplanten Importjob

# flushQueue
source: Flush the import queue
de: Den Import-Stapel leeren

# queueCount
source: There are %1s records in the import queue for this page that still need to be imported.
de: Es befinden sich %1s extrahierte XML-Datensätze auf dem Import-Stapel für diese Seite.

# batchImportSuccess
source: %1s records have been imported successfully.
de: %1s Datensätze wurden erfolgreich importiert.

# batchImportDeactivated
source: Batch import functionality is deactivated
de: Massenimport-Modul ist deaktiviert.

# errmsg.idFirst
source: Please click on a page in the pagetree.
de: Bitte klicken Sie zuerst auf eine Seite im Seitenbaum.

# errmsg.missingconfig
source: The module is not configured correctly for this page.
de: Das Modul ist für diese Seite nicht richtig konfiguriert.

# errmsg.generalerror
source: Some basic error occured. Please check your module settings.
de: Ein grundlegender Fehler ist aufgetreten. Bitte überprüfen Sie die Moduleinstellungen.

# errmsg.noData
source: Error while loading the XML data. Please check your file path and your XML.
de: Das XML für den Import konnte nicht geladen werden. Bitte prüfen Sie den Dateipfad und/oder Ihre XML Daten.

# errmsg.parsingError
source: Some errors occured while parsing the XML file:
de: Es sind Fehler beim Parsing der XML Datei aufgetreten:

# errmsg.matchingError
source: >Some problem occured while matching the XML tags to the database fields:
de: Es gab ein Problem bei der Zusammenführung der Felddefinitionen für den Import:

# errmsg.noFile
source: No file was submitted an no standard file is defined.
de: Es wurde keine Datei ausgewählt und es gibt keine hinterlegte Standard-Datei.

# errmsg.forbiddenFile
source: This type of file is not allowed!
de: Der angegebene Dateityp ist nicht erlaubt!

# errmsg.tableNotConfigured
source: Import configuration check: The following table is not configured in $TCA and will be removed -
de: Die folgende Import-Tabelle ist nicht im $TCA konfiguriert und wird entfernt -

# errmsg.noFieldsConfigured
source: Import configuration check: The following table has no fields configured and will be removed -
de: Für die folgende Tabelle sind keine Import-Felder definiert, sie wird daher entfernt -

# errmsg.noFieldMatch
source: None of the found XML tags matches the specified field list
de: Keines der XML-Felder passt auf die Feldnamen der Import-Tabelle

# errmsg.noValuesExtracted
source: No values could be extracted from the XML file:
de: Es konnten keine Werte aus der XML-Datei für die Felder der Import-Tabelle extrahiert werden:

# errmsg.fieldNotConfigured
source: Import configuration check: The following field is not configured in $TCA and will be removed -
de: Das folgende Import-Feld ist nicht im $TCA konfiguriert und wird entfernt -

# errmsg.importConfigurationError
source: Your import configuration could not be validated. Please check it.
de: Die Modulkonfiguration für diese Seite konnte nicht validiert werden. Bitte überprüfen Sie Ihre Modulkonfiguration.

# errmsg.noRecordNodeFound
source: Your xpath query did not return any nodes -
de: Ihre XPATH Abfrage lieferte keine Ergebnisse -

# errmsg.entryNodeNotFound
source: The configured entry node for the XML extraction could not be found -
de: Der konfigurierte XML Einstiegsknoten für die Datenextraktion konnte nicht gefunden werden -

# errmsg.xmlCouldNotBeConverted
source: The submitted XML could not be converted to simpleXML. Please check your data and your PHP configuration.
de: Das geladene XML konnte nicht nach simpleXML konvertiert werden. Bitte prüfen Sie Ihre XML Daten und Ihre PHP Konfiguration.

# errmsg.identifierFieldError
source: The fields specified as identifiers are not configured in your field list and will be removed -
de: Die als Identifier angegebenen Feldnamen sind nicht in der Feldliste der Tabelle konfiguriert und werden entfernt -

# errmsg.cacheHasExpired
source: The cache lifetime for the import queue of the current page has expired.
de: Die Cachelaufzeit des Import-Stapels für die aktuelle Seite ist abgelaufen.

# errmsg.tableNamesFieldValueContainsNoValue
source: The specified tabenames field contains no value.
de: Das angegebene Feld für die tablenames Funktionalität enthält keinen Wert

# errmsg.relatedRecordsDontExist
source: Either the local, foreign or both of the MM related records does not exist.
de: Entweder der lokale, der fremde oder beide MM verknüpften Datensätze existieren nicht.

# errmsg.relatedTablesNotInTCA
source: Eiter one or both MM related tables do not exist in $TCA.
de: Entweder eine oder beide MM verknüpften Tabellen sind nicht in der $TCA Konfiguration definiert.
